---
kind: type
id: T:Autodesk.Revit.DB.Structure.SurfaceElementExtension
source: html/951ab38f-aede-43e8-8906-07e99cdc91c0.htm
---
# Autodesk.Revit.DB.Structure.SurfaceElementExtension

Presets for given Analytical Extension.

## Syntax (C#)
```csharp
public enum SurfaceElementExtension
```